Server/gsoap/ServiceSoap.HelloWorld.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
  xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:tempuri="http://tempuri.org/">
 <SOAP-ENV:Body>
   <tempuri:HelloWorld>
   </tempuri:HelloWorld>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
